In [67]:
import numpy as np
import pandas as pd
import matplotlib
matplotlib.use('Agg')
import matplotlib.pyplot as plt

In [15]:
sales_data = pd.read_csv("D:\\APP\\NITW\\Applications using Python\\Assignment_2\\Problem1\\sales.csv")

In [6]:
sales_data.head()

   Unnamed: 0  year     month  sales
0           0  1949   January    112
1           1  1949  February    118
2           2  1949     March    132
3           3  1949     April    129
4           4  1949       May    121

In [11]:
np.sum(sales_data.isnull())

Unnamed: 0    0
year          0
month         0
sales         0
dtype: int64

In [20]:
sales_data_relevant = sales_data.drop(['month', 'Unnamed: 0'], axis=1)

In [22]:
sales_data_relevant.head()

   year  sales
0  1949    112
1  1949    118
2  1949    132
3  1949    129
4  1949    121

In [52]:
sales_data_yearly = sales_data_relevant.groupby(['year']).sum()

In [53]:
sales_data_yearly

      sales
year
1949   1520
1950   1676
1951   2042
1952   2364
1953   2700
1954   2867
1955   3408
1956   3939
1957   4421
1958   4572
1959   5140
1960   5714

In [54]:
sales_data_yearly = pd.DataFrame(sales_data_yearly.to_records())

In [55]:
sales_data_yearly.head()

   year  sales
0  1949   1520
1  1950   1676
2  1951   2042
3  1952   2364
4  1953   2700

In [71]:
f, (axis1, axis2) = plt.subplots(nrows=2, ncols=1)
axis1.plot(sales_data_yearly['year'], sales_data_yearly['sales'])
axis2.set_title('Sales Year-wise')
axis2.scatter(sales_data_yearly['year'], sales_data_yearly['sales'])
plt.savefig('D:\\APP\\NITW\\Applications using Python\\Assignment_2\\Problem1\\solution1.png')

In [58]:
sales_data_yearly_sorted = sales_data_yearly.sort_values(['sales'], ascending=False)

In [64]:
highest_sales_year = sales_data_yearly_sorted.head(1)

In [66]:
print(highest_sales_year['year'])

11    1960
Name: year, dtype: int64